-- الترجمة العربية للانفنتوري (مفعلة دائماً بغض النظر عن qb_locale)
local Translations = {
    progress = {
        ['snowballs'] = 'جاري جمع كرات الثلج...',
    },
    notify = {
        ['failed'] = 'فشلت العملية',
        ['canceled'] = 'تم الإلغاء',
        ['vlocked'] = 'المركبة مقفلة',
        ['notowned'] = 'أنت لا تملك هذا الغرض!',
        ['missitem'] = 'هذا الغرض غير موجود عندك!',
        ['nonb'] = 'لا يوجد لاعب قريب منك!',
        ['noaccess'] = 'لا يمكن الوصول',
        ['nosell'] = 'لا يمكنك بيع هذا الغرض.',
        ['itemexist'] = 'هذا الغرض غير موجود.',
        ['notencash'] = 'ليس لديك نقود كافية.',
        ['noitem'] = 'ليس لديك الأغراض المطلوبة.',
        ['gsitem'] = 'لا يمكنك إعطاء غرض لنفسك!',
        ['tftgitem'] = 'أنت بعيد جداً لإعطاء الأغراض!',
        ['infound'] = 'الغرض الذي تحاول إعطاءه غير موجود!',
        ['iifound'] = 'الغرض غير صحيح، حاول مرة أخرى!',
        ['gitemrec'] = 'استلمت ',
        ['gitemfrom'] = ' من ',
        ['gitemyg'] = 'أعطيت ',
        ['gitinvfull'] = 'حقيبة اللاعب الآخر ممتلئة!',
        ['giymif'] = 'حقيبتك ممتلئة!',
        ['gitydhei'] = 'ليس لديك الكمية الكافية من هذا الغرض',
        ['gitydhitt'] = 'ليس لديك أغراض كافية للنقل',
        ['navt'] = 'نوع غير صالح.',
        ['anfoc'] = 'لم يتم إدخال البيانات بشكل صحيح.',
        ['yhg'] = 'لقد أعطيت ',
        ['cgitem'] = 'لا يمكن إعطاء الغرض!',
        ['idne'] = 'الغرض غير موجود',
        ['pdne'] = 'اللاعب غير متصل',
        ['nogunbag'] = 'لا يمكنك حمل سلاح وحقيبة في نفس الوقت!',
        ['hasbag'] = 'أنت تحمل حقيبة بالفعل، ضعها أولاً!',
        ['invinuse'] = 'هذا المخزن مستخدم حالياً من شخص آخر',
        ['notenoughstock'] = 'لا يمكنك شراء أكثر من الكمية المتوفرة',
        ['canthold'] = 'لا يمكنك حمل هذا الغرض',
    },
    inf_mapping = {
        ['opn_inv'] = 'فتح الحقيبة',
        ['tog_slots'] = 'إظهار / إخفاء خانات الاستخدام السريع',
        ['use_item'] = 'استخدام الغرض في الخانة ',
    },
    menu = {
        ['vending'] = 'آلة البيع',
        ['bin'] = 'فتح الحاوية',
        ['craft'] = 'تصنيع',
        ['o_bag'] = 'فتح الحقيبة',
        ['p_bag'] = 'حمل الحقيبة',
    },
    interaction = {
        ['craft'] = '~g~E~w~ - تصنيع',
        ['drop_bag'] = 'اضغط [G] لوضع الحقيبة',
    },
}

Lang = Locale:new({
    phrases = Translations,
    warnOnMissing = true
})
